app/controllers/presurveys/part1_controller.rb

  def new
    @all_schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    if params[:admin]
      school = School.find(params[:admin][:school_id])
    else
      school = School.find(@school)
    end
    begin
      ps = @current_user.presurvey_part1s.new
      ps.school_semester_id = SchoolSemester.find(school).id
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1
SELECT "school_semesters".* FROM "school_semesters" WHERE "school_semesters"."id" = 1 LIMIT 1