app/controllers/presurveys/part2_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @all_schools = School.all

SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1
SELECT "school_semesters".* FROM "school_semesters" WHERE "school_semesters"."id" = 1 LIMIT 1
---
  def create
    if params[:admin]
      school = School.find(params[:admin][:school_id])
    else
      school = School.find(@school)
    end
    begin
      ps = @current_user.presurvey_part2s.new
      ps.school_semester_id = SchoolSemester.find(school).id