app/views/admin/_schools.html.haml

- if @current_user.admin?
  = collection_select(:admin, :school_id, School.all, :id, :name)
---
SELECT "schools".* FROM "schools"