app/views/users/all_users.html.haml

          %td= user[:email]
          %td= select_tag "colleges[#{user[:id]}]", options_for_select(College.all.collect { |s| ["#{s.name}", s.id ]}, :selected => user[:college_name]), :style => "wdith: 150px;"
          %td= select_tag "schools[#{user[:id]}]", options_for_select(School.all.collect { |s| ["#{s.name}, #{s.county}, #{s.city}", s.id ] }, :selected => user[:school_id]), :style => "width: 300px;"
---
SELECT "colleges".* FROM "colleges"
SELECT "schools".* FROM "schools"