app/views/users/pending_users.html.haml

SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" IS NULL LIMIT 1
SELECT "schools".* FROM "schools"
---
              %em= user.email
          %td= select_tag "college[#{user[:id]}]", options_for_select(College.all.collect { |s| ["#{s.name}", s.id ]}, :selected => user.college.id), :style => "width: 125px;"
          %td= select_tag "school[#{user[:id]}]", options_for_select(School.all.collect { |s| ["#{s.name}, #{s.city}, #{s.county}", s.id]}, :selected => user.pending_school_id), :style => "width: 325px;"