app/views/home/_ps2.html.haml

    %br
- Efficacy.find_by_part2_id(survey.id).attributes.each do |k,v|
---
SELECT "efficacies".* FROM "efficacies" WHERE "efficacies"."part2_id" = 1 LIMIT 1