app/views/home/portal.html.haml

SELECT "postsurveys".* FROM "postsurveys"
---
  Total Number of Students:
  = @current_user.postsurveys.first.number_students