app/controllers/admin_controller.rb

  def create
    if not params[:user].values.all?{|v| v.empty?}
      name = params[:user][:name]
      email = params[:user][:email]
      password = params[:user][:password]
      confirm = params[:user][:confirm_password]

      if password.length < 6
        flash[:warning] = "Password must have 6 characters or more"
      elsif not valid_email? email
        flash[:warning] = "Not a valid email address"
      elsif not password.eql? confirm
        flash[:warning] = "Passwords did not match"
      else
        begin
          @user = User.create!(:name => name, :email => email, :password => password, :profile_id => Profile.find_by_label("admin").id)
---
INSERT INTO "users" ("college", "created_at", "email", "name", "password_digest", "profile_id", "school_semester_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "profiles".* FROM "profiles" WHERE "profiles"."label" = 'admin' LIMIT 1