app/controllers/colleges_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def index
    @all_colleges = College.all

INSERT INTO "colleges" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Oct 2013 01:02:54 UTC +00:00], ["name", "UC Berkeley"], ["updated_at", Mon, 28 Oct 2013 01:02:54 UTC +00:00]]
---
  def create
    begin
      College.create!(params[:college])