app/controllers/reports_controller.rb

SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1
SELECT "schools".* FROM "schools"
INSERT INTO "reports" ("created_at", "eval_intro", "main_title", "note", "school_intro_title", "school_introduction", "school_semester_id", "strength_weakness_title", "strengths", "summary", "updated_at", "weaknesses") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "static_contents".* FROM "static_contents" LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "school_semesters" ON "users"."school_semester_id" = "school_semesters"."id" WHERE "school_semesters"."school_id" = 1
---
  def create
    @school_semester = @current_user.school_semester
    @schools = @current_user.schools
    @school = School.find_by_id(params[:school])

    if @schools.include?(@school)
      if @school.has_all_report_data
        @report = Report.create!(:school_semester_id => @school_semester.id)
        @report_created = true

        #static content
        @static_contents = StaticContent.first
        #populate_objectives

        #dynamic content
        @ambassadors = ""
        @school.users.each do |user|

SELECT "reports".* FROM "reports" WHERE "reports"."id" = 1 LIMIT 1
SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1
---
  def generate_pdf
    @report = Report.find_by_id(params[:report][:id])
    @school = School.find_by_id(params[:school][:id])

SELECT COUNT(*) FROM "users" INNER JOIN "school_semesters" ON "users"."school_semester_id" = "school_semesters"."id" WHERE "school_semesters"."school_id" = 2
SELECT "static_contents".* FROM "static_contents" LIMIT 1
---
  def show

    @reportNote = session[:amb_note]

    schoolName = @school.name
    schoolName.gsub! /\s+/, '_'
    schoolName = schoolName.downcase
    @fileName = "#{schoolName}_report.pdf"

    @school_semester = @current_user.school_semester
    schoolName.gsub!(/_/, ' ')
    @school.name.gsub!(/_/, ' ')

    @main_title = "Fruitful Minds #{@school.name} Fall 2013 Report"
    @main_semester_title = "#{@school_semester.name}  #{@school_semester.year} Report"
    @school_intro_title = "Fruitful Minds at #{@school.name}"
    @school_intro = "Fruitful Minds held a nutrition lesson series at #{@school.name} during #{@school_semester.name} #{@school_semester.year}"
    @school_intro_second = "    #{@school.users.size} students from UC Berkeley #{@ambassadors} were selected as Fruitful Minds ambassadors"
    @school_intro_third = "    During each 50-minute lesson, class facilitators delivered the cirriculum material through lectures, games, and various interactive activities."
    @eval_intro_first = "Prior to the 7-week curriculum, a pre-curriculum survey was distributed to assess the students\' knowledge in nutrition; a very similar survey was administered during the final class. The goal of the surveys was to determine the retention of key learning objectives from the Fruitful Minds program."
    @efficacy = calculate_efficacy
    @eval_intro_second = "On average, students have shown a #{@efficacy}% improvement after going through seven weeks of classes."
    @eval_intro_third = "The survey results are shown below. The first graph shows the average scores in each of the six nutrition topics covered in the curriculum (see graph 1). Note that the number of questions in each category varies. The second graph shows students\' overall performance on the pre-curriculum surveys and post-curriculum survey (see graph 2). #{@ps_part1.number_students} students took the pre-curriculum survey part 1, #{@ps_part2.number_students} students took the pre-efficacy survey part 2, and #{@ps.number_students} students took the post-curriculum surveys."
    @strength_weakness_title = "Strengths and Weaknesses of FM Lessons at #{@school.name}"
    @static_contents = StaticContent.first

SELECT "school_semesters".* FROM "school_semesters"
---
  def all_efficacies
    @ss_efficacies = []
    SchoolSemester.all.each do |ss|