app/controllers/schools_controller.rb

  def index
    @all_schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    begin
      School.create!(params[:school])
---
INSERT INTO "schools" ("city", "county", "created_at", "district", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "cities"], ["county", "counties"], ["created_at", Mon, 21 Oct 2013 01:09:51 UTC +00:00], ["district", nil], ["name", "names"], ["updated_at", Mon, 21 Oct 2013 01:09:51 UTC +00:00]]

  def edit
    @school_fields = School.find(params[:id])
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1

  def update
    begin
      School.find(params[:id]).update_attributes!(params[:school])
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = 1 LIMIT 1
UPDATE "schools" SET "name" = 'foo', "county" = 'bar', "city" = 'baz', "updated_at" = '2013-10-21 01:09:52.387260' WHERE "schools"."id" = 1