app/controllers/sessions_controller.rb

  def create
    user = User.where(:email => params[:user][:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'amirk88@gmail.com' LIMIT 1