app/controllers/users_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."label" = 'ambassador' LIMIT 1
---
          ActiveRecord::Base.transaction do
            begin
            # create user
            @user = User.create(:name => "#{firstName} #{lastName}",
                                :email => email,
                                :password => password,
                                :college => college,
                                :profile_id => Profile.find_by_label("ambassador").id)