app/controllers/users_controller.rb

  def new
    @school_names = School.all.collect { |s| ["#{s.name}, #{s.city}, #{s.county}", s.id ] }.uniq.sort
---
SELECT "schools".* FROM "schools"