app/controllers/users_controller.rb

INSERT INTO "users" ("college", "created_at", "email", "name", "password_digest", "profile_id", "school_semester_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pending_users" ("created_at", "school_city", "school_county", "school_district", "school_name", "semester_name", "semester_year", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
          ActiveRecord::Base.transaction do
            begin
            # create user
            @user = User.create(:name => "#{firstName} #{lastName}",
                                :email => email,
                                :password => password,
                                :college => College.find_by_name(college),
                                :profile_id => Profile.find_by_label("ambassador").id)
            # add user's id to :pending_users table
            PendingUser.create!(:user_id => @user.id,
                                :school_name => schoolName,
                                :school_city => schoolCity,
                                :school_county => schoolCounty,
                                :school_district => schoolDistrict,
                                :semester_name => semesterName,
                                :semester_year => semesterYear)

SELECT "users".* FROM "users"
SELECT "pending_users".* FROM "pending_users" WHERE "pending_users"."user_id" = 3 LIMIT 1
SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" IS NULL LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def all_users
    @all_users = []
    User.all.each do |user|
      if !user.admin? and !PendingUser.find_by_user_id(user.id)
        @college = College.find_by_id(user.college)

SELECT "pending_users".* FROM "pending_users"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" IS NULL LIMIT 1
---
  def pending_users
    @pending_users = []
    PendingUser.all.each do |puser|
      user = User.find(puser.user_id)
      @college = College.find_by_id(user.college)

SELECT "schools".* FROM "schools" WHERE (lower(name) = 'school1' and lower(city) = 'berkeley' and lower(county) = 'alameda' and lower(district) = 'district') LIMIT 1
---
  def update_pending_users
    approved_users = ""
    disapproved_users = ""

    # Users to be approved
    if not params[:approves].nil?
      params[:approves].keys.each do |uid|

        # fields that admin might have modified
        user_college = params[:colleges][uid]
        school_name = params[:school_names][uid]
        school_city = params[:school_cities][uid]
        school_district = params[:school_districts][uid]
        school_county = params[:school_counties][uid]
        semester_name = params[:semester_names][uid] # Fall, Winter, Spring, Summer
        semester_year = params[:date][uid] # a 4-digit number, e.g 2012

        # find school with the given info
        #puts "name: #{school_name}\tcity: #{school_city}\tdistrict: #{school_district}\tcounty: #{school_county}"
        school = School.where(
            "lower(name) = :name and lower(city) = :city and lower(county) = :county and lower(district) = :district",
            :name => school_name.downcase,
            :city => school_city.downcase,
            :district => school_district.downcase,
            :county => school_county.downcase).first

SELECT "school_semesters".* FROM "school_semesters" WHERE "school_semesters"."school_id" = 1 AND "school_semesters"."name" = 'Fall' AND "school_semesters"."year" = 2012 LIMIT 1
---
          redirect_to pending_users_path and return
        end

        semester = SchoolSemester.where(:school_id => school.id, :name => semester_name, :year => semester_year).first

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "school_semester_id" = 1, "updated_at" = '2013-10-21 01:09:31.235579' WHERE "users"."id" = 3
---
        semester = SchoolSemester.create!(:school_id => school.id, :name => semester_name, :year => semester_year) if semester.nil?

        # update user attributes and delete the user from pending_users table
        user = User.find_by_id(uid)
        user.college = College.find_by_name(user_college)
        user.school_semester_id = semester.id
        if user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
      params[:disapproves].keys.each do |uid|
        user = User.find_by_id(uid)
        disapproved_users << "#{user.name} "
        user.destroy